; domain
(define (domain puzzle)
  (:requirements :strips :equality :typing)
  (:types num loc)
  (:predicates 
    (is-at ?n - num ?l - loc)
    (adjacent ?l1 ?l2 - loc)
    (is-empty ?l - loc))
  (:action slide
    :parameters (?n - num ?l1 ?l2 - loc)
    :precondition (and (is-at ?n ?l1)(is-empty ?l2)(adjacent ?l1 ?l2)(not(= ?l1 ?l2)))
    :effect (and (is-at ?n ?l2)(is-empty ?l1)(not (is-empty ?l2))))
)

; problem
(define (problem PPT1)
  (:domain puzzle)
  (:objects L1 L2 L3 L4 L5 L6 L7 L8 L9 L10 L11 L12 L13 L14 L15 L16 - loc
            B1 B2 B3 B4 B5 B6 B7 B8 B9 B10 B11 B12 B13 B14 B15 empty - num)
  (:init (is-at B1 L7)(is-at B2 L9)(is-at B3 L10)(is-at B4 L5)(is-at B5 L11)
         (is-at B6 L3)(is-at B7 L15)(is-at B8 L8)(is-at B9 L6) (is-at B10 L2)(is-at B11 L12)
         (is-at B12 L13)(is-at B13 L14)(is-at B14 L1)(is-at B15 L16)(is-at empty L4)(is-empty L4)

         (adjacent L1 L2)(adjacent L2 L3)(adjacent L3 L4)(adjacent L4 L8)(adjacent L1 L5)(adjacent L2 L6)
         (adjacent L3 L7)(adjacent L5 L6)(adjacent L5 L9)(adjacent L6 L7)(adjacent L6 L10)(adjacent L7 L8)
         (adjacent L7 L11)(adjacent L8 L12)(adjacent L9 L10)(adjacent L13 L9)(adjacent L10 L11)(adjacent L10 L14)
         (adjacent L11 L12)(adjacent L11 L15)(adjacent L12 L16)(adjacent L13 L14)(adjacent L14 L15)(adjacent L16 L15)

         (adjacent L2 L1)(adjacent L3 L2)(adjacent L4 L3)(adjacent L8 L4)(adjacent L5 L1)(adjacent L6 L2)
         (adjacent L7 L3)(adjacent L6 L5)(adjacent L9 L5)(adjacent L7 L6)(adjacent L10 L6)(adjacent L8 L7)
         (adjacent L11 L7)(adjacent L12 L8)(adjacent L10 L9)(adjacent L9 L13)(adjacent L11 L10)(adjacent L14 L10)
         (adjacent L12 L11)(adjacent L15 L11)(adjacent L16 L12)(adjacent L14 L13)(adjacent L15 L14)(adjacent L15 L16))
  (:goal (and (is-at B1 L1)(is-at B2 L2)(is-at B3 L3)(is-at B4 L4)(is-at B5 L5)
              (is-at B6 L6)(is-at B7 L7)(is-at B8 L8)(is-at B9 L9) (is-at B10 L10)
              (is-at B11 L11)(is-at B12 L12)(is-at B13 L13)(is-at B14 L14)(is-at B15 L15)
              (is-at empty L16)(is-empty L16)))
)

; plan
1. (slide b6 l3 l4)
   deleted: (is-empty l4)
   added: (is-at b6 l4) (is-empty l3)
   goals met: 1 of 17
2. (slide b1 l7 l3)
   deleted: (is-empty l3)
   added: (is-at b1 l3) (is-empty l7)
   goals met: 1 of 17
3. (slide b5 l11 l7)
   deleted: (is-empty l7)
   added: (is-at b5 l7) (is-empty l11)
   goals met: 1 of 17
4. (slide b11 l12 l11)
   deleted: (is-empty l11)
   added: (is-at b11 l11) (is-empty l12)
   goals met: 2 of 17
5. (slide b15 l16 l12)
   deleted: (is-empty l12)
   added: (is-at b15 l12) (is-empty l16)
   goals met: 3 of 17
6. (slide b7 l15 l16)
   deleted: (is-empty l16)
   added: (is-at b7 l16) (is-empty l15)
   goals met: 2 of 17
7. (slide b15 l16 l15)
   deleted: (is-empty l15)
   added: (is-at b15 l15) (is-empty l16)
   goals met: 4 of 17
8. (slide b7 l15 l16)
   deleted: (is-empty l16)
   added: (is-empty l15)
   goals met: 3 of 17
9. (slide b13 l14 l15)
   deleted: (is-empty l15)
   added: (is-at b13 l15) (is-empty l14)
   goals met: 3 of 17
10. (slide b12 l13 l14)
   deleted: (is-empty l14)
   added: (is-at b12 l14) (is-empty l13)
   goals met: 3 of 17
11. (slide b13 l14 l13)
   deleted: (is-empty l13)
   added: (is-at b13 l13) (is-empty l14)
   goals met: 4 of 17
12. (slide b3 l10 l14)
   deleted: (is-empty l14)
   added: (is-at b3 l14) (is-empty l10)
   goals met: 4 of 17
13. (slide b9 l6 l10)
   deleted: (is-empty l10)
   added: (is-at b9 l10) (is-empty l6)
   goals met: 4 of 17
14. (slide b4 l5 l6)
   deleted: (is-empty l6)
   added: (is-at b4 l6) (is-empty l5)
   goals met: 4 of 17
15. (slide b2 l9 l5)
   deleted: (is-empty l5)
   added: (is-at b2 l5) (is-empty l9)
   goals met: 4 of 17
16. (slide b9 l10 l9)
   deleted: (is-empty l9)
   added: (is-at b9 l9) (is-empty l10)
   goals met: 5 of 17
17. (slide b9 l6 l10)
   deleted: (is-empty l10)
   added: (is-empty l6)
   goals met: 5 of 17
18. (slide b2 l5 l6)
   deleted: (is-empty l6)
   added: (is-at b2 l6) (is-empty l5)
   goals met: 5 of 17
19. (slide b14 l1 l5)
   deleted: (is-empty l5)
   added: (is-at b14 l5) (is-empty l1)
   goals met: 5 of 17
20. (slide b10 l2 l1)
   deleted: (is-empty l1)
   added: (is-at b10 l1) (is-empty l2)
   goals met: 5 of 17
21. (slide b2 l6 l2)
   deleted: (is-empty l2)
   added: (is-at b2 l2) (is-empty l6)
   goals met: 6 of 17
22. (slide b10 l2 l6)
   deleted: (is-empty l6)
   added: (is-at b10 l6) (is-empty l2)
   goals met: 6 of 17
23. (slide b4 l6 l2)
   deleted: (is-empty l2)
   added: (is-at b4 l2) (is-empty l6)
   goals met: 6 of 17
24. (slide b3 l10 l6)
   deleted: (is-empty l6)
   added: (is-at b3 l6) (is-empty l10)
   goals met: 6 of 17
25. (slide b10 l6 l10)
   deleted: (is-empty l10)
   added: (is-at b10 l10) (is-empty l6)
   goals met: 7 of 17
26. (slide b5 l7 l6)
   deleted: (is-empty l6)
   added: (is-at b5 l6) (is-empty l7)
   goals met: 7 of 17
27. (slide b9 l6 l7)
   deleted: (is-empty l7)
   added: (is-at b9 l7) (is-empty l6)
   goals met: 7 of 17
28. (slide b4 l5 l6)
   deleted: (is-empty l6)
   added: (is-empty l5)
   goals met: 7 of 17
29. (slide b5 l6 l5)
   deleted: (is-empty l5)
   added: (is-at b5 l5) (is-empty l6)
   goals met: 8 of 17
30. (slide b5 l7 l6)
   deleted: (is-empty l6)
   added: (is-empty l7)
   goals met: 8 of 17
31. (slide b6 l3 l7)
   deleted: (is-empty l7)
   added: (is-at b6 l7) (is-empty l3)
   goals met: 8 of 17
32. (slide b4 l2 l3)
   deleted: (is-empty l3)
   added: (is-at b4 l3) (is-empty l2)
   goals met: 8 of 17
33. (slide b5 l6 l2)
   deleted: (is-empty l2)
   added: (is-at b5 l2) (is-empty l6)
   goals met: 8 of 17
34. (slide b6 l7 l6)
   deleted: (is-empty l6)
   added: (is-at b6 l6) (is-empty l7)
   goals met: 9 of 17
35. (slide b4 l3 l7)
   deleted: (is-empty l7)
   added: (is-at b4 l7) (is-empty l3)
   goals met: 9 of 17
36. (slide empty l4 l3)
   deleted: (is-empty l3)
   added: (is-at empty l3) (is-empty l4)
   goals met: 9 of 17
37. (slide b4 l3 l4)
   deleted: (is-empty l4)
   added: (is-at b4 l4) (is-empty l3)
   goals met: 10 of 17
38. (slide b5 l2 l3)
   deleted: (is-empty l3)
   added: (is-at b5 l3) (is-empty l2)
   goals met: 10 of 17
39. (slide b3 l6 l2)
   deleted: (is-empty l2)
   added: (is-at b3 l2) (is-empty l6)
   goals met: 10 of 17
40. (slide b1 l7 l6)
   deleted: (is-empty l6)
   added: (is-at b1 l6) (is-empty l7)
   goals met: 10 of 17
41. (slide b6 l3 l7)
   deleted: (is-empty l7)
   added: (is-empty l3)
   goals met: 10 of 17
42. (slide b3 l2 l3)
   deleted: (is-empty l3)
   added: (is-at b3 l3) (is-empty l2)
   goals met: 11 of 17
43. (slide b1 l6 l2)
   deleted: (is-empty l2)
   added: (is-at b1 l2) (is-empty l6)
   goals met: 11 of 17
44. (slide b10 l2 l6)
   deleted: (is-empty l6)
   added: (is-empty l2)
   goals met: 11 of 17
45. (slide b14 l1 l2)
   deleted: (is-empty l2)
   added: (is-at b14 l2) (is-empty l1)
   goals met: 11 of 17
46. (slide b1 l2 l1)
   deleted: (is-empty l1)
   added: (is-at b1 l1) (is-empty l2)
   goals met: 12 of 17
47. (slide b4 l3 l2)
   deleted: (is-empty l2)
   added: (is-empty l3)
   goals met: 12 of 17
48. (slide b5 l7 l3)
   deleted: (is-empty l3)
   added: (is-empty l7)
   goals met: 12 of 17
49. (slide b11 l11 l7)
   deleted: (is-empty l7)
   added: (is-at b11 l7) (is-empty l11)
   goals met: 12 of 17
50. (slide b7 l15 l11)
   deleted: (is-empty l11)
   added: (is-at b7 l11) (is-empty l15)
   goals met: 12 of 17
51. (slide b13 l14 l15)
   deleted: (is-empty l15)
   added: (is-empty l14)
   goals met: 12 of 17
52. (slide b10 l10 l14)
   deleted: (is-empty l14)
   added: (is-at b10 l14) (is-empty l10)
   goals met: 12 of 17
53. (slide b9 l6 l10)
   deleted: (is-empty l10)
   added: (is-empty l6)
   goals met: 12 of 17
54. (slide b11 l7 l6)
   deleted: (is-empty l6)
   added: (is-at b11 l6) (is-empty l7)
   goals met: 12 of 17
55. (slide b7 l11 l7)
   deleted: (is-empty l7)
   added: (is-at b7 l7) (is-empty l11)
   goals met: 13 of 17
56. (slide b15 l15 l11)
   deleted: (is-empty l11)
   added: (is-at b15 l11) (is-empty l15)
   goals met: 13 of 17
57. (slide b12 l14 l15)
   deleted: (is-empty l15)
   added: (is-at b12 l15) (is-empty l14)
   goals met: 13 of 17
58. (slide b3 l10 l14)
   deleted: (is-empty l14)
   added: (is-empty l10)
   goals met: 13 of 17
59. (slide b11 l11 l10)
   deleted: (is-empty l10)
   added: (is-at b11 l10) (is-empty l11)
   goals met: 13 of 17
60. (slide b12 l15 l11)
   deleted: (is-empty l11)
   added: (is-at b12 l11) (is-empty l15)
   goals met: 13 of 17
61. (slide b15 l16 l15)
   deleted: (is-empty l15)
   added: (is-empty l16)
   goals met: 14 of 17
62. (slide b11 l12 l16)
   deleted: (is-empty l16)
   added: (is-at b11 l16) (is-empty l12)
   goals met: 13 of 17
63. (slide b12 l11 l12)
   deleted: (is-empty l12)
   added: (is-at b12 l12) (is-empty l11)
   goals met: 14 of 17
64. (slide b9 l7 l11)
   deleted: (is-empty l11)
   added: (is-at b9 l11) (is-empty l7)
   goals met: 14 of 17
65. (slide b12 l11 l7)
   deleted: (is-empty l7)
   added: (is-at b12 l7) (is-empty l11)
   goals met: 14 of 17
66. (slide b15 l15 l11)
   deleted: (is-empty l11)
   added: (is-empty l15)
   goals met: 14 of 17
67. (slide b12 l14 l15)
   deleted: (is-empty l15)
   added: (is-empty l14)
   goals met: 14 of 17
68. (slide b3 l10 l14)
   deleted: (is-empty l14)
   added: (is-empty l10)
   goals met: 14 of 17
69. (slide b9 l9 l10)
   deleted: (is-empty l10)
   added: (is-empty l9)
   goals met: 14 of 17
70. (slide b14 l5 l9)
   deleted: (is-empty l9)
   added: (is-at b14 l9) (is-empty l5)
   goals met: 14 of 17
71. (slide b6 l6 l5)
   deleted: (is-empty l5)
   added: (is-at b6 l5) (is-empty l6)
   goals met: 14 of 17
72. (slide b3 l10 l6)
   deleted: (is-empty l6)
   added: (is-empty l10)
   goals met: 14 of 17
73. (slide b14 l9 l10)
   deleted: (is-empty l10)
   added: (is-at b14 l10) (is-empty l9)
   goals met: 14 of 17
74. (slide b12 l13 l9)
   deleted: (is-empty l9)
   added: (is-at b12 l9) (is-empty l13)
   goals met: 14 of 17
75. (slide b3 l14 l13)
   deleted: (is-empty l13)
   added: (is-at b3 l13) (is-empty l14)
   goals met: 14 of 17
76. (slide b14 l10 l14)
   deleted: (is-empty l14)
   added: (is-at b14 l14) (is-empty l10)
   goals met: 15 of 17
77. (slide b11 l11 l10)
   deleted: (is-empty l10)
   added: (is-empty l11)
   goals met: 15 of 17
78. (slide b15 l12 l11)
   deleted: (is-empty l11)
   added: (is-empty l12)
   goals met: 15 of 17
79. (slide b7 l16 l12)
   deleted: (is-empty l12)
   added: (is-at b7 l12) (is-empty l16)
   goals met: 16 of 17
80. (slide b12 l12 l16)
   deleted: (is-empty l16)
   added: (is-at b12 l16) (is-empty l12)
   goals met: 15 of 17
81. (slide b8 l8 l12)
   deleted: (is-empty l12)
   added: (is-at b8 l12) (is-empty l8)
   goals met: 15 of 17
82. (slide empty l4 l8)
   deleted: (is-empty l8)
   added: (is-at empty l8) (is-empty l4)
   goals met: 15 of 17
83. (slide b8 l8 l4)
   deleted: (is-empty l4)
   added: (is-at b8 l4) (is-empty l8)
   goals met: 15 of 17
84. (slide b11 l12 l8)
   deleted: (is-empty l8)
   added: (is-at b11 l8) (is-empty l12)
   goals met: 15 of 17
85. (slide empty l8 l12)
   deleted: (is-empty l12)
   added: (is-at empty l12) (is-empty l8)
   goals met: 15 of 17
86. (slide b11 l12 l8)
   deleted: (is-empty l8)
   added: (is-empty l12)
   goals met: 15 of 17
87. (slide b15 l16 l12)
   deleted: (is-empty l12)
   added: (is-empty l16)
   goals met: 16 of 17
88. (slide empty l12 l16)
   deleted: (is-empty l16)
   added: (is-at empty l16) (is-empty l12)
   goals met: 16 of 17
89. (slide b15 l16 l12)
   deleted: (is-empty l12)
   added: (is-empty l16)
   goals met: 17 of 17
